---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionSetOfRefsChanged
source: html/39d6e5a2-a4f2-57cf-1a67-61120422d78f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionSetOfRefsChanged Property

The set of input elements was changed and the connection has been adjusted.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralConnectionSetOfRefsChanged { get; }
```